In [1]:
import requests
import sqlite3
import time
import pandas as pd

In [2]:
conn = sqlite3.connect("data/students.db")
c = conn.cursor()

In [3]:
# c.execute("""ALTER TABLE students ADD COLUMN completed INT DEFAULT 0 NOT NULL;""")

OperationalError: duplicate column name: completed

In [4]:
# head of students table
c.execute("""select * from students;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

   id                 name  batch_id                  created_at  completed
0   1     Heather Thornton         1  2019-08-29 14:47:40.243534          0
1   2           David Nash         1  2019-08-29 14:47:40.245261          0
2   3        Stephen Garza         1  2019-08-29 14:47:40.246862          0
3   4         Anthony Lowe         1  2019-08-29 14:47:40.248548          0
4   5  Christopher Pearson         1  2019-08-29 14:47:42.795572          0

In [5]:
df.shape

(1110, 5)

In [ ]:
# df['completed'] = 0

In [6]:
df.tail()

        id           name  batch_id                  created_at  completed
1105  1106   Dakota Hurst       112  2019-08-29 19:17:27.902201          0
1106  1107  Richard Lopez        29  2019-08-29 19:17:30.503774          0
1107  1108  Dana Thompson        78  2019-08-29 19:17:30.569022          0
1108  1109    Linda Booth       144  2019-08-29 19:17:30.655447          0
1109  1110    John Benson       161  2019-08-29 19:17:30.723216          0

In [ ]:
c.execute("""CREATE TABLE IF NOT EXISTS batches (
    id INT PRIMARY KEY NOT NULL,
    name CHAR() NOT NULL,
    created_at TIMESTAMP NOT NULL
) WITHOUT ROWID;""")

In [ ]:
c.execute("""SELECT b.id, b.name, s.name.count()
            FROM students s
            JOIN matches b ON s.batch_id = b.id
            
            ;""")

In [13]:
#df['completed'][test_run_json['student_id'] - 1] += 1
df['completed'][1110 - 1] += 1

/Users/Frankie/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [15]:
df.tail()

        id           name  batch_id                  created_at  completed
1105  1106   Dakota Hurst       112  2019-08-29 19:17:27.902201          0
1106  1107  Richard Lopez        29  2019-08-29 19:17:30.503774          0
1107  1108  Dana Thompson        78  2019-08-29 19:17:30.569022          0
1108  1109    Linda Booth       144  2019-08-29 19:17:30.655447          0
1109  1110    John Benson       161  2019-08-29 19:17:30.723216          1

In [18]:
batch_df = df.groupby(by='batch_id', as_index=False).count()

In [19]:
batch_df.head()

   batch_id  id  name  created_at  completed
0         1  45    45          45         45
1         2  32    32          32         32
2         3  31    31          31         31
3         4  25    25          25         25
4         5  16    16          16         16